# Да свържем 
# СИМВОЛ - с друг - СИМВОЛ
# РЕЧНИЦИ - dictunary / map
character_map = {
    "a" :	"@(",
    "b" :	"!@",
    "c" :	"(",
    "d" :	"@!",
    "e" :	"(-",
    "f" :	"!-",
    "g" :	"&",
    "h" :	"!%",
    "i" :	"!",
    "j" :	".!",
    "k" :	"!<",
    "l" :	"!!",
    "m" :	"^^",
    "n" :	"%",
    "o" :	"()",
    "p" :	"!^@",
    "q" :	"!.@",
    "r" :	"@<",
    "s" :	")(",
    "t" :	"/_",
    "u" :	"^>",
    "v" :	"<!>",
    "w" :	"><",
    "x" :	"<>",
    "y" :	".=.",
    "z" :	"#$",
}

print(character_map["a"])

# Взимаме думата
# intervenzia
# И за всеки нейн символ - който можем да вземем
# като обходим думата символ по символ в ЦИКИЛ
# За всеки символ - правим проверка в РЕЧНИКА
# и добавяме резултата в един краен НИЗ

def translateWord(word):
    pass


# korekzia
# pregovori