# # правим коментар с # 
# # Задача 1
# print("Мазе бот v1 на Вашите услуги")

# # можем да ползваме единични кавички
# # само да не ги смесваме
# # print('Мазе бот v1 на Вашите услуги')

# # Задача 2
# # Как се прави променлива ?

# # създаваме идентификатор ИЛИ име на променливата 
# # в нея ще пази произволни данни
# # оператора = се нарича ПРИСВОЯВАНЕ 
# first_name = input("Въведете първо име: ")

# # my-personal-id

# # Camil Case - не е характерно
# # firstName = "Михаил"
# # myPersonalId

# # Pascal Case - СВРЪХ не характерно
# # FirstName = "Михаил"
# # MyPersonalId

# family_name = input("Въведете фамилия: ")
# id = input("Въведете уникален идентификатор: ")
# age = input("Въведете възраст: ")

# # Правим си нова променлива в която да пазим стойността на първото и второто име
# # долепване на текст -- КОНкатенация / concat
# full_name = first_name + " " + family_name
# # full_name = "Mihail" + "Petrov"
# # Здравеи 
# print("Здравей " + full_name )
# # Ти си с уникален идентификатор ID
# print("Ти си с уникален идентификатор " + id)

# # Ти си на X години
# print("Ти си на " + age + " години")

# # Правила за писане на променливи
# # - всяка една променлива трябва да е достатъчно описателна
# # - типът на променливата трябва да е очевиден от името
# # - избягвайте числа в променливите 
# # - НЕ МОЖЕ ДА ЗАПОЧВАТЕ ИМЕ НА ПРОМЕНЛИВА С ЧИСЛО
# # - само на англиски 
# # - конвенция с подчертаващи тирета при писане на променливи
# # - Всяка променлива трябва да има стойност

# # Задача 4
# # артикул	характеристика	количество	сигнатура на артикула
# # ябълково	вино	10	C7544
# # пушено	месо	5	M7441
# # сливов	мармалад	9	S6491
# # мариновани	чушки	4	P7485
# # прасенце	касичка	184 лв и 35 стотинки	B6584


# Когато декларираме променливи винаги е добра идея 
# да добавяме СУФИКС - които да подсказва типът на СТОЙНОСТТА, която носи променливата
apple_wine_volume       = 10
apple_wine_signature    = "C7544"

smoked_ham_weight = 5
smoked_ham_signature = "M7441"

plump_jam_volume = 9
plump_jam_signature = "S6491"

pepar_jar_count = 4
pepar_jar_signature = "P7485"

piggy_bank_amount = 184.35
piggy_bank_signature = "B6584"

print(piggy_bank_amount)

# ВИНАГИ ВАНИГИ ВИНАГИ - когато работите с дроби, 
# Ползвайте ТОЧКА за разделител между цели и дробни числа. 

# ТОВА не е правилен начин за записване на дробни числа
# piggy_bank_amount = 184,35
# print(piggy_bank_amount)